# copy를 이용한 데이터 복사

* 데이터 생성

In [1]:
import pandas as pd
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

-문제 : 필드명을 a,b,c 에서 d,e,f로 변경하시오.

In [2]:
df.columns = ['d','e','f']

In [3]:
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

-문제: 필드명을 a에서 '에이'로 변경하시오.

In [4]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

In [7]:
df.rename(columns={'a': '에이'}, inplace=True)

In [8]:
df

   에이  b  c
0   1  4  7
1   2  5  8
2   3  6  9

-변수명을 복제하여 해결??

In [9]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})
df2 = df

In [10]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [11]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [12]:
df.columns = ['d','e','f']

In [13]:
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [14]:
df2

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

* deep copy 를 통한 해결

In [15]:
import copy

In [16]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})
df2 = copy.deepcopy(df)

In [17]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [18]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [19]:
df.columns = ['d','e','f']

In [20]:
df

   d  e  f
0  1  4  7
1  2  5  8
2  3  6  9

In [21]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

# 시리즈

* 데이터 생성

In [22]:
import pandas as pd
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

In [23]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

-a 열을 추출하시오

In [24]:
df['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [25]:
type(df['a'])

pandas.core.series.Series

* 시리즈 생성 방법

In [26]:
a = pd.Series([1,2,3,1,2,3])

In [27]:
a

0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64

-인덱스 변경

In [28]:
a = pd.Series([1,2,3,1,2,3], index = ['a','b','c','d','e','f'])

In [29]:
a

a    1
b    2
c    3
d    1
e    2
f    3
dtype: int64

In [30]:
a['e']

2

* 유일한 값 찾기

-아래 테이블(df)의 a 필드의 값들 중 유일한 것들만 추출하시오.

In [31]:
df = pd.DataFrame({'a': [1,2,3,1,2,3], 'b': [4,5,6,6,7,8], 'c': [7,8,9,10,11,12]})

In [32]:
a = df['a']

In [33]:
a

0    1
1    2
2    3
3    1
4    2
5    3
Name: a, dtype: int64

In [34]:
type(a)

pandas.core.series.Series

In [35]:
a.unique()

array([1, 2, 3], dtype=int64)

In [36]:
a.unique()[2]

3

-문제: a,b 열을 추출하시오.

In [37]:
df = pd.DataFrame({'a': [1,2,3], 'b': [4,5,6], 'c': [7,8,9]})

In [38]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [39]:
df['a', 'b']

KeyError: ('a', 'b')

# loc과 iloc을 이용한 원하는 위치의 데이터 추출

- 데이터 생성

In [40]:
import pandas as pd

In [41]:
df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]})

In [42]:
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

-문제: a,b 열을 추출하시오.

In [43]:
df['a', 'b']

KeyError: ('a', 'b')

In [44]:
df[['a','b']]

    a   b
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [45]:
type(df[['a','b']])

pandas.core.frame.DataFrame

In [47]:
df[0]

KeyError: 0

loc을 통한 해결

In [48]:
df.loc[0]

a     1
b    11
c    21
Name: 0, dtype: int64

-슬라이스도 가능

In [49]:
df.loc[2:4]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

-인덱스가 문자로 이루어진 데이터 프레임 생성

In [52]:
index = ['a','b','c','d','e','f','g','g','h','i']

In [53]:
df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]}, index= index)

In [54]:
df

    a   b   c
a   1  11  21
b   2  12  22
c   3  13  23
d   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [55]:
df.loc[0]

KeyError: 0

In [57]:
df.loc['g']

   a   b   c
g  7  17  27
g  8  18  28

In [58]:
index = ['a','b','d','c','e','f','g','g','h','i']

In [59]:
df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]}, index= index)

In [60]:
df

    a   b   c
a   1  11  21
b   2  12  22
d   3  13  23
c   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [61]:
df.loc['c':]

    a   b   c
c   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

-문제: 열이 a,c이며 인덱스가 g,i인 데이터를 출력하시오

In [62]:
df

    a   b   c
a   1  11  21
b   2  12  22
d   3  13  23
c   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [63]:
df.loc[['g','i'],['a','c']]

    a   c
g   7  27
g   8  28
i  10  30

-문제: 처음부터 5번째 까지의 데이터와 첫 번째 열과 세 번째 열의 데이터를 추출하시오.

In [64]:
df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]})

In [65]:
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [66]:
df.iloc[:5,[0,2]]

   a   c
0  1  21
1  2  22
2  3  23
3  4  24
4  5  25

In [67]:
index = ['a','b','d','c','e','f','g','g','h','i']
df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]}, index= index)

In [68]:
df

    a   b   c
a   1  11  21
b   2  12  22
d   3  13  23
c   4  14  24
e   5  15  25
f   6  16  26
g   7  17  27
g   8  18  28
h   9  19  29
i  10  20  30

In [70]:
df.iloc[:5, [0,2]]

   a   c
a  1  21
b  2  22
d  3  23
c  4  24
e  5  25

# 조건에 맞는 데이터 추출

- 데이터 생성

In [71]:
import pandas as pd

df = pd.DataFrame({'a': [i for i in range(1,11)], 'b': [i for i in range(11,21)], 'c': [i for i in range(21, 31)]})

In [72]:
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

-문제: a,c 열을 출력하시오

In [73]:
df[['a', 'c']]

    a   c
0   1  21
1   2  22
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

-문제: a가 3 이상인 데이터를 출력하시오

In [74]:
df[df['a'] >= 3]

    a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

-문제: a가 3인 이상인데이터 중 a,c열만 출력하시오

In [75]:
df[df['a'] >= 3][['a','c']]

    a   c
2   3  23
3   4  24
4   5  25
5   6  26
6   7  27
7   8  28
8   9  29
9  10  30

-문제: a가 3 이상이고, b가 16미만인 데이터를 출력하시오

In [80]:
df[(df['a'] >= 3) & (df['b'] < 16)]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

In [81]:
a = (df['a'] >= 3) & (df['b'] < 16)

In [83]:
a

0    False
1    False
2     True
3     True
4     True
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [84]:
type(a)

pandas.core.series.Series

In [85]:
df[a]

   a   b   c
2  3  13  23
3  4  14  24
4  5  15  25

-문제: a가 3 이하 이거나 7 이상인 데이터를 출력하시오.

In [86]:
df

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
3   4  14  24
4   5  15  25
5   6  16  26
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

In [87]:
df[(df['a']<=3) | (df['a']>=7)]

    a   b   c
0   1  11  21
1   2  12  22
2   3  13  23
6   7  17  27
7   8  18  28
8   9  19  29
9  10  20  30

-문제: a가 3 이상이고, b가 16 미만이거나 c가 30인 데이터를 출력하시오

In [89]:
df[(df['a']>=3)&((df['b']<16) | (df['c'] == 30))]

    a   b   c
2   3  13  23
3   4  14  24
4   5  15  25
9  10  20  30

# 정렬

* 데이터 생성

In [90]:
import pandas as pd

df = pd.DataFrame({'a' : [2,3,2,7,4], 'b' : [2,1,3,5,3], 'c' : [1,1,2,3,5]})

In [91]:
df

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

* 인덱스 기준 정렬

In [92]:
df.sort_index()

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

- 내림차순일때는 ascending = Flase

In [94]:
df.sort_index(ascending=False)

   a  b  c
4  4  3  5
3  7  5  3
2  2  3  2
1  3  1  1
0  2  2  1

결과를 저장하고 싶으면 inplace = True

In [95]:
df.sort_index(ascending=False, inplace= True)

In [96]:
df

   a  b  c
4  4  3  5
3  7  5  3
2  2  3  2
1  3  1  1
0  2  2  1

- 인덱스 초기화는 reset_index()

In [97]:
df.reset_index()

   index  a  b  c
0      4  4  3  5
1      3  7  5  3
2      2  2  3  2
3      1  3  1  1
4      0  2  2  1

In [98]:
df

   a  b  c
4  4  3  5
3  7  5  3
2  2  3  2
1  3  1  1
0  2  2  1

In [100]:
df.reset_index(drop= True, inplace=True)

In [101]:
df

   a  b  c
0  4  3  5
1  7  5  3
2  2  3  2
3  3  1  1
4  2  2  1

* 값 기준 정렬

In [102]:
df = df = pd.DataFrame({'a' : [2,3,2,7,4], 'b' : [2,1,3,5,3], 'c' : [1,1,2,3,5]})

In [103]:
df

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

- 문제: a 열 기준으로 오름차순 정렬하시오

In [104]:
df.sort_values(by= ['a'])

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

In [105]:
df

   a  b  c
0  2  2  1
1  3  1  1
2  2  3  2
3  7  5  3
4  4  3  5

In [106]:
df.sort_values(by= ['a'], inplace= True)

In [107]:
df

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

- a열 기준으로 내림차순 정렬하시오

In [108]:
df.sort_values(by= ['a'], ascending= False)

   a  b  c
3  7  5  3
4  4  3  5
1  3  1  1
0  2  2  1
2  2  3  2

- 문제: a,b 열 기준으로 오름차순 정렬하시오

In [110]:
df.sort_values(by=['a', 'b'])

   a  b  c
0  2  2  1
2  2  3  2
1  3  1  1
4  4  3  5
3  7  5  3

- 문제: a열 기준으로 오름착순 정렬 한 이후, b 열 기준으로 내림차순 정렬하시오

In [111]:
df.sort_values(by=['a', 'b'], ascending=[True, False])

   a  b  c
2  2  3  2
0  2  2  1
1  3  1  1
4  4  3  5
3  7  5  3

In [113]:
# df값에 저장
df.sort_values(by=['a', 'b'], ascending=[True, False], inplace= True)

In [114]:
df.reset_index(drop=True, inplace=True)

In [115]:
df

   a  b  c
0  2  3  2
1  2  2  1
2  3  1  1
3  4  3  5
4  7  5  3

# 결측값 처리

In [117]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'a': [1,1,3,4,5], 'b': [2,3,np.nan,3,4], 'c': [3,4,7,6,4]})

In [118]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  NaN  7
3  4  3.0  6
4  5  4.0  4

* 결측 유무 확인

In [119]:
df.isnull()

       a      b      c
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False  False
4  False  False  False

* 결측값 개수 확인

In [120]:
df.isnull().sum()

a    0
b    1
c    0
dtype: int64

* 결측값이 포함된 열 / 행 지우기

-결측값이 포함된 행 지우기

In [121]:
df.dropna()

   a    b  c
0  1  2.0  3
1  1  3.0  4
3  4  3.0  6
4  5  4.0  4

In [123]:
# df에 저장할 때
df.dropna(inplace= True)

* 결측값이 포함된 열 지우기

In [124]:
df = pd.DataFrame({'a': [1,1,3,4,5], 'b': [2,3,np.nan,3,4], 'c': [3,4,7,6,4]})

In [125]:
df.dropna(axis=1)

   a  c
0  1  3
1  1  4
2  3  7
3  4  6
4  5  4

In [126]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  NaN  7
3  4  3.0  6
4  5  4.0  4

In [128]:
# df에 값을 저장하고 싶을 때

df.dropna(axis=1, inplace= True)

In [129]:
df

   a  c
0  1  3
1  1  4
2  3  7
3  4  6
4  5  4

*  결측값을 다른 값으로 대체하기

In [130]:
df = pd.DataFrame({'a': [1,1,3,4,5], 'b': [2,3,np.nan,3,4], 'c': [3,4,7,6,4]})

-특정값으로 대체하기

In [131]:
df.fillna(0, inplace= True)

In [132]:
df

   a    b  c
0  1  2.0  3
1  1  3.0  4
2  3  0.0  7
3  4  3.0  6
4  5  4.0  4

-앞이나 뒤의 숫자로 바꾸기

In [134]:
df = pd.DataFrame({'a': [1,1,3,4,np.nan], 'b': [2,3,np.nan,np.nan,4], 'c': [np.nan,4,7,6,4]})

In [135]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

1) 뒤의 값으로 채우기

In [136]:
df.fillna(method= 'bfill')

     a    b    c
0  1.0  2.0  4.0
1  1.0  3.0  4.0
2  3.0  4.0  7.0
3  4.0  4.0  6.0
4  NaN  4.0  4.0

In [137]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

2. 뒤의 값으로 채우기

In [138]:
df.fillna(method= 'ffill')

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  3.0  7.0
3  4.0  3.0  6.0
4  4.0  4.0  4.0

- limit 설정

In [140]:
df.fillna(method='ffill', limit=1)

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  3.0  7.0
3  4.0  NaN  6.0
4  4.0  4.0  4.0

- 문제: 데이터 프레임에 존재하는 결측값들을 뒤의 값으로 대체한 이후 앞의 값으로 대체하시오

In [141]:
df = pd.DataFrame({'a': [1,1,3,4,np.nan], 'b': [2,3,np.nan,np.nan,4], 'c': [np.nan,4,7,6,4]})

In [142]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

In [143]:
df.fillna(method='bfill', inplace=True)

In [144]:
df

     a    b    c
0  1.0  2.0  4.0
1  1.0  3.0  4.0
2  3.0  4.0  7.0
3  4.0  4.0  6.0
4  NaN  4.0  4.0

In [145]:
df.fillna(method='ffill', inplace=True)

In [146]:
df

     a    b    c
0  1.0  2.0  4.0
1  1.0  3.0  4.0
2  3.0  4.0  7.0
3  4.0  4.0  6.0
4  4.0  4.0  4.0

- 평균으로 대체

In [147]:
df = pd.DataFrame({'a': [1,1,3,4,np.nan], 'b': [2,3,np.nan,np.nan,4], 'c': [np.nan,4,7,6,4]})

In [148]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

In [149]:
df.mean()['a']

2.25

In [150]:
df.fillna(df.mean()['a'])

      a     b     c
0  1.00  2.00  2.25
1  1.00  3.00  4.00
2  3.00  2.25  7.00
3  4.00  2.25  6.00
4  2.25  4.00  4.00

In [152]:
df.mean()

a    2.25
b    3.00
c    5.25
dtype: float64

In [153]:
df.fillna(df.mean())

      a    b     c
0  1.00  2.0  5.25
1  1.00  3.0  4.00
2  3.00  3.0  7.00
3  4.00  3.0  6.00
4  2.25  4.0  4.00

In [154]:
df

     a    b    c
0  1.0  2.0  NaN
1  1.0  3.0  4.0
2  3.0  NaN  7.0
3  4.0  NaN  6.0
4  NaN  4.0  4.0

- 문제: b,c의 결측값들을 데이터 프레임의 전체 값의 평균으로 치환하시오.

In [155]:
df.fillna(df.mean()[['b','c']])

     a    b     c
0  1.0  2.0  5.25
1  1.0  3.0  4.00
2  3.0  3.0  7.00
3  4.0  3.0  6.00
4  NaN  4.0  4.00

# 타입 변환

* 데이터 생성

In [1]:
import pandas as pd

df = pd.DataFrame({'판매일' : ['5/11/21', '5/12/21', '5/13/21', '5/14/21', '5/15/21'],
                   '판매량' : ['10', '15', '20', '25', '30'], '방문자수' : ['10', '-', '17', '23', '25'],
                   '기온' : ['24.1', '24.3', '24.8', '25', '25.4']})

In [2]:
df

       판매일 판매량 방문자수    기온
0  5/11/21  10   10  24.1
1  5/12/21  15    -  24.3
2  5/13/21  20   17  24.8
3  5/14/21  25   23    25
4  5/15/21  30   25  25.4

* 타입 확인

In [3]:
df.dtypes

판매일     object
판매량     object
방문자수    object
기온      object
dtype: object

In [4]:
df['판매량 보정'] = df['판매량'] + 1

TypeError: can only concatenate str (not "int") to str

- 문제 : 판매량을 정수 형태로 변환하시오.

In [ ]:
df.astype({'판매량' : 'int'})

       판매일  판매량 방문자수    기온
0  5/11/21   10   10  24.1
1  5/12/21   15    -  24.3
2  5/13/21   20   17  24.8
3  5/14/21   25   23    25
4  5/15/21   30   25  25.4

In [ ]:
df.dtypes

판매일     object
판매량     object
방문자수    object
기온      object
dtype: object

In [ ]:
df = df.astype({'판매량' : 'int'})

In [ ]:
df.dtypes

판매일     object
판매량      int32
방문자수    object
기온      object
dtype: object

In [5]:
df['판매량 보정'] = df['판매량'] + 1

TypeError: can only concatenate str (not "int") to str

In [6]:
df

       판매일 판매량 방문자수    기온
0  5/11/21  10   10  24.1
1  5/12/21  15    -  24.3
2  5/13/21  20   17  24.8
3  5/14/21  25   23    25
4  5/15/21  30   25  25.4

* 문제 : 방문자수를 숫자 타입으로 변형 하시오.

In [7]:
df.astype({'방문자수' : 'int'})

ValueError: invalid literal for int() with base 10: '-'

In [ ]:
pd.to_numeric(df['방문자수'])

ValueError: Unable to parse string "-" at position 1

In [8]:
# 에러부분을 NaN값으로 바꿔주기

pd.to_numeric(df['방문자수'], errors= 'coerce')

0    10.0
1     NaN
2    17.0
3    23.0
4    25.0
Name: 방문자수, dtype: float64

In [9]:
df.dtypes

판매일     object
판매량     object
방문자수    object
기온      object
dtype: object

In [10]:
df['방문자수'] = pd.to_numeric(df['방문자수'], errors= 'coerce')

In [11]:
df.dtypes

판매일      object
판매량      object
방문자수    float64
기온       object
dtype: object

In [12]:
df = df.astype({'방문자수' : 'int'})

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [13]:
df.fillna(0, inplace = True)

In [14]:
df

       판매일 판매량  방문자수    기온
0  5/11/21  10  10.0  24.1
1  5/12/21  15   0.0  24.3
2  5/13/21  20  17.0  24.8
3  5/14/21  25  23.0    25
4  5/15/21  30  25.0  25.4

In [15]:
df = df.astype({'방문자수' : 'int'})

In [16]:
df.dtypes

판매일     object
판매량     object
방문자수     int32
기온      object
dtype: object

- 문제 : 판매일을 datetime의 형태로 바꾸시오.

In [18]:
df['판매일'] = pd.to_datetime(df['판매일'], format="%m/%d/%y")

In [19]:
df

         판매일 판매량  방문자수    기온
0 2021-05-11  10    10  24.1
1 2021-05-12  15     0  24.3
2 2021-05-13  20    17  24.8
3 2021-05-14  25    23    25
4 2021-05-15  30    25  25.4

In [20]:
df.dtypes

판매일     datetime64[ns]
판매량             object
방문자수             int32
기온              object
dtype: object

# 레코드, 칼럼 추가/삭제

In [1]:
import pandas as pd
df = pd. DataFrame({'a' : [1,1,3,4,5], 'b' : [2,3,2,3,4], 'c' : [3,4,7,6,4]})

In [22]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

* 칼럼 추가

* 문제 : 1,3,6,4,8 로 이루어진 d 칼럼을 추가하시오.

In [39]:
df['d'] = [1,3,6,4,8]

In [40]:
df

   a  b  c  d
0  1  2  3  1
1  1  3  4  3
2  3  2  7  6
3  4  3  6  4
4  5  4  4  8

* 1 로 이루어진 e칼럼을 추가하시오.

In [41]:
df['e'] = [1,1,1,1,1]

In [42]:
df

   a  b  c  d  e
0  1  2  3  1  1
1  1  3  4  3  1
2  3  2  7  6  1
3  4  3  6  4  1
4  5  4  4  8  1

또는

In [43]:
df['e'] = 1

In [44]:
df

   a  b  c  d  e
0  1  2  3  1  1
1  1  3  4  3  1
2  3  2  7  6  1
3  4  3  6  4  1
4  5  4  4  8  1

In [45]:
df.dtypes

a    int64
b    int64
c    int64
d    int64
e    int64
dtype: object

* 문제: a+b-c의 결과로 이루어진 f 칼럼을 추가하시오.

In [46]:
df['f'] = df['a'] + df['b'] - df['c']

In [47]:
df

   a  b  c  d  e  f
0  1  2  3  1  1  0
1  1  3  4  3  1  0
2  3  2  7  6  1 -2
3  4  3  6  4  1  1
4  5  4  4  8  1  5

* 칼럼 삭제

    -문제: 칼럼 d,e,f 를 삭제하시오.

In [48]:
df.drop(['d','e','f'], axis=1)

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

In [50]:
# df에 저장
df.drop(['d','e','f'], inplace= True)

KeyError: "['d', 'e', 'f'] not found in axis"

In [51]:
df

   a  b  c  d  e  f
0  1  2  3  1  1  0
1  1  3  4  3  1  0
2  3  2  7  6  1 -2
3  4  3  6  4  1  1
4  5  4  4  8  1  5

* 레코드 추가  
    -문제 : a에는 6 b에는 7 c에는 8을 추가하시오

In [35]:
df.append({'a' : 6, 'b' : 7, 'c' : 8})

C:\Users\camar\AppData\Local\Temp\ipykernel_14512\2155385221.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'a' : 6, 'b' : 7, 'c' : 8})

TypeError: Can only append a dict if ignore_index=True

In [36]:
df.append({'a' : 6, 'b' : 7, 'c' : 8}, ignore_index= True)

C:\Users\camar\AppData\Local\Temp\ipykernel_14512\2968883352.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'a' : 6, 'b' : 7, 'c' : 8}, ignore_index= True)

   a  b  c    d    e    f
0  1  2  3  1.0  1.0  0.0
1  1  3  4  3.0  1.0  0.0
2  3  2  7  6.0  1.0 -2.0
3  4  3  6  4.0  1.0  1.0
4  5  4  4  8.0  1.0  5.0
5  6  7  8  NaN  NaN  NaN

In [2]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4

In [4]:
df = df.append({'a' : 6, 'b' : 7, 'c' : 8}, ignore_index= True)

C:\Users\camar\AppData\Local\Temp\ipykernel_17628\4061447410.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'a' : 6, 'b' : 7, 'c' : 8}, ignore_index= True)

In [5]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8

- a에는 7 b에는 8 c에는 9를 추가하시오

In [6]:
df.loc[6] = [7,8,9]

In [7]:
df

   a  b  c
0  1  2  3
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8
6  7  8  9

* 레코드 삭제  
    -문제: 첫 번째 레코드를 삭제하시오.

In [9]:
df = df.drop(0)

In [10]:
df

   a  b  c
1  1  3  4
2  3  2  7
3  4  3  6
4  5  4  4
5  6  7  8
6  7  8  9

* 문제 : 첫 번째, 두 번째 레코드를 삭제하시오.

In [12]:
df = df.drop([1,2])

* 문제 : 첫 번째에서 네 번째 레코드를 삭제하시오.

In [14]:
df = pd. DataFrame({'a' : [1,1,3,4,5], 'b' : [2,3,2,3,4], 'c' : [3,4,7,6,4]})

In [15]:
df = df.drop([i for i in range(4)])

In [17]:
df

   a  b  c
4  5  4  4

또는

In [18]:
df = pd. DataFrame({'a' : [1,1,3,4,5], 'b' : [2,3,2,3,4], 'c' : [3,4,7,6,4]})

df.drop(df.index[:4])

   a  b  c
4  5  4  4

* a가 4 미만인 레코드들을 삭제하시오.

In [19]:
df[df['a']<4].index

Int64Index([0, 1, 2], dtype='int64')

In [20]:
df.drop(df[df['a']<4].index)

   a  b  c
3  4  3  6
4  5  4  4

* 문제: a가 3 미만이고 c가 4인 레코드들을 삭제하시오.

In [21]:
df[(df['a']<3) & (df['c'] == 4)].index

Int64Index([1], dtype='int64')

In [22]:
df.drop(df[(df['a']<3) & (df['c'] == 4)].index)

   a  b  c
0  1  2  3
2  3  2  7
3  4  3  6
4  5  4  4

# apply, map을 활용한 데이터 변환

In [23]:
import pandas as pd

df = pd.DataFrame({'a' : [1,2,3,4,5]})

* 문제 : a가 2보다 작으면 '2미만', 4보다 작으면 '4미만', 4보다 크면 '4이상'이 저장된 b 칼럼을 추가하시오.

In [24]:
df

   a
0  1
1  2
2  3
3  4
4  5

In [25]:
df['b'] = 0

In [26]:
df

   a  b
0  1  0
1  2  0
2  3  0
3  4  0
4  5  0

In [27]:
a = df[df['a']<2]

In [28]:
a

   a  b
0  1  0

In [29]:
df['b'][a.index] = '2 미만'

In [30]:
df

   a     b
0  1  2 미만
1  2     0
2  3     0
3  4     0
4  5     0

In [31]:
a = df[(df['a']>=2) & (df['a']<4)]

In [32]:
a

   a  b
1  2  0
2  3  0

In [33]:
df['b'][a.index] = '4 미만'

In [34]:
df

   a     b
0  1  2 미만
1  2  4 미만
2  3  4 미만
3  4     0
4  5     0

In [35]:
a = df[df['a']>=4]

In [36]:
a

   a  b
3  4  0
4  5  0

In [37]:
df['b'][a.index] = '4 이상'

In [38]:
df

   a     b
0  1  2 미만
1  2  4 미만
2  3  4 미만
3  4  4 이상
4  5  4 이상

* 함수 + apply를 이용한 해결

In [39]:
def case_function(x):
    if x<2:
        return '2 미만'
    elif x<4:
        return '4 미만'
    else:
        return '4 이상'

In [40]:
df['c'] = df['a'].apply(case_function)

In [41]:
df

   a     b     c
0  1  2 미만  2 미만
1  2  4 미만  4 미만
2  3  4 미만  4 미만
3  4  4 이상  4 이상
4  5  4 이상  4 이상

* 문제 : a가 1이면 'one', 2이면 'two', 3이면 'three', 4이면 'four', 5이면 'five'를 출력하는 칼럼 d를 만드시오.

In [42]:
def case_function_eng(x):
    if x == 1:
        return 'one'
    elif x == 2:
        return 'two'
    elif x == 3:
        return 'three'
    elif x == 4:
        return 'four'
    else:
        return 'five'

In [43]:
df['d'] = df['a'].apply(case_function_eng)

In [44]:
df

   a     b     c      d
0  1  2 미만  2 미만    one
1  2  4 미만  4 미만    two
2  3  4 미만  4 미만  three
3  4  4 이상  4 이상   four
4  5  4 이상  4 이상   five

- map을 이용한 해결 방법

In [45]:
a = {1 : 'one', 2 : 'two', 3: 'three', 4: 'four', 5: 'five'}

In [46]:
df['e'] = df['a'].map(a)

In [47]:
df

   a     b     c      d      e
0  1  2 미만  2 미만    one    one
1  2  4 미만  4 미만    two    two
2  3  4 미만  4 미만  three  three
3  4  4 이상  4 이상   four   four
4  5  4 이상  4 이상   five   five

# 데이터 프레임 결합

1) 상하결합

In [48]:
import pandas as pd
df1 = pd.DataFrame({'A' : [1,2,3], 'B' : [11,12,13], 'C' : [21,22,23]})
df2 = pd.DataFrame({'A' : [4,5,6], 'B' : [14,15,16], 'C' : [24,25,26]})

In [49]:
pd.concat([df1, df2])

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23
0  4  14  24
1  5  15  25
2  6  16  26

In [50]:
pd.concat([df2,df1])

   A   B   C
0  4  14  24
1  5  15  25
2  6  16  26
0  1  11  21
1  2  12  22
2  3  13  23

- index 초기화를 위해서는 ignore_index = True

In [51]:
pd.concat([df2,df1], ignore_index= True)

   A   B   C
0  4  14  24
1  5  15  25
2  6  16  26
3  1  11  21
4  2  12  22
5  3  13  23

- 필드의 순서가 섞였을 때 결합 결과 확인

In [53]:
df1 = pd.DataFrame({'A' : [1,2,3], 'B' : [11,12,13], 'C' : [21,22,23]})
df2 = pd.DataFrame({'B' : [4,5,6], 'A' : [14,15,16], 'C' : [24,25,26]})

In [54]:
pd.concat([df1,df2])

    A   B   C
0   1  11  21
1   2  12  22
2   3  13  23
0  14   4  24
1  15   5  25
2  16   6  26

- 서로 다른 필드로 구성되어 있는 데이터 프레임의 결합

In [56]:
df1 = pd.DataFrame({'A' : [1,2,3], 'B' : [11,12,13], 'C' : [21,22,23], 'D' : [31,32,33]})
df2 = pd.DataFrame({'A' : [4,5,6], 'B' : [14,15,16], 'C' : [24,25,26], 'E' : [41,42,43]})

In [57]:
pd.concat([df1,df2])

   A   B   C     D     E
0  1  11  21  31.0   NaN
1  2  12  22  32.0   NaN
2  3  13  23  33.0   NaN
0  4  14  24   NaN  41.0
1  5  15  25   NaN  42.0
2  6  16  26   NaN  43.0

In [58]:
pd.concat([df1,df2], join='outer')

   A   B   C     D     E
0  1  11  21  31.0   NaN
1  2  12  22  32.0   NaN
2  3  13  23  33.0   NaN
0  4  14  24   NaN  41.0
1  5  15  25   NaN  42.0
2  6  16  26   NaN  43.0

In [60]:
# 각 데이터프레임들의 교집합인 부분만 추출
pd.concat([df1,df2], join='inner')

   A   B   C
0  1  11  21
1  2  12  22
2  3  13  23
0  4  14  24
1  5  15  25
2  6  16  26